In [1]:
#UAS SPADA no 2
#Muhammad Firdaus Maulana
#21.52.0017
#Lakukan clasifikasi dengan menggunakan Algoritma Na√Øve Bayes dalam soal No. 1 dan berapa persen 
#tingkat pembelian komputer dari Student = Yes, dengan tingkat income = Low !

In [5]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [17]:
data = pd.read_excel('E:/!!!STIMATA/MATKUL/SISTEM CERDAS/UAS_SPADA/dataset/dataset_soal No.1.xlsx')

In [18]:
data.head()

      Age  Income Student Credit_rating Class (buy_computer)
0   <= 30    High      No          Fair                   No
1   <= 30    High      No     Excellent                   No
2  31..40    High      No          Fair                  Yes
3    > 40  Medium      No          Fair                  Yes
4    > 40     Low     Yes          Fair                  Yes

In [10]:
data.shape

(51, 1)

In [19]:
data['Student'].value_counts()

Yes    27
No     24
Name: Student, dtype: int64

In [20]:
data['Income'].value_counts()

Low       21
Medium    19
High      11
Name: Income, dtype: int64

In [21]:
pd.crosstab(data['Student'],data['Income'])

Income   High  Low  Medium
Student
No          9    1      14
Yes         2   20       5

In [22]:
# Kondisi : Student = Yes, Income = Low

P_StudentYes = 2/11
P_IncomeLow = 1/21

P_hasil = (P_StudentYes/P_IncomeLow)*100
print(P_hasil)

381.8181818181818